Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM100.atdf
         <register caption="ADC Digital Comparator x Control Register (x = 2 through 6)" name="ADCCMPCON3" offset="0xa8" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON3__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON3__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON3__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON3__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON3__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON3__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON3__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON3__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON3__AINID"/>
         </register>
         <register caption="ADC Digital Comparator x Control Register (x = 2 through 6)" name="ADCCMPCON4" offset="0xac" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON4__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON4__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON4__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON4__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON4__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON4__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON4__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON4__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON4__AINID"/>
         </register>
         <register caption="ADC Digital Comparator x Control Register (x = 2 through 6)" name="ADCCMPCON5" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON5__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON5__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON5__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON5__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON5__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON5__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON5__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON5__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON5__AINID"/>
         </register>
         <register caption="ADC Digital Comparator x Control Register (x = 2 through 6)" name="ADCCMPCON6" offset="0xb4" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON6__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON6__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON6__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON6__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON6__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON6__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON6__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON6__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON6__AINID"/>
         </register>
         <register caption="ADC FIFO Status Register" name="ADCFSTAT" offset="0xb8" rw="RW" size="4">
            <bitfield caption="ADCx Identifier bits" mask="0x00000007" name="ADCID" values="ADCFSTAT__ADCID"/>
            <bitfield mask="0x00000080" name="FSIGN"/>
            <bitfield mask="0x0000FF00" name="FCNT"/>
            <bitfield caption="FIFO Write Overflow Error Status bit" mask="0x00200000" name="FWROVERR" values="ADCFSTAT__FWROVERR"/>
            <bitfield caption="FIFO Data Ready Interrupt Status bit" mask="0x00400000" name="FRDY" values="ADCFSTAT__FRDY"/>
            <bitfield caption="FIFO Interrupt Enable bit" mask="0x00800000" name="FIEN" values="ADCFSTAT__FIEN"/>
            <bitfield caption="ADC0 Enable bit" mask="0x01000000" name="ADC0EN" values="ADCFSTAT__ADC0EN"/>
            <bitfield caption="ADC1 Enable bit" mask="0x02000000" name="ADC1EN" values="ADCFSTAT__ADC1EN"/>
            <bitfield caption="ADC2 Enable bit" mask="0x04000000" name="ADC2EN" values="ADCFSTAT__ADC2EN"/>
            <bitfield caption="ADC3 Enable bit" mask="0x08000000" name="ADC3EN" values="ADCFSTAT__ADC3EN"/>
            <bitfield caption="ADC4 Enable bit" mask="0x10000000" name="ADC4EN" values="ADCFSTAT__ADC4EN"/>
            <bitfield mask="0x20000000" name="ADC5EN"/>
            <bitfield mask="0x40000000" name="ADC6EN"/>
            <bitfield caption="FIFO Enable bit" mask="0x80000000" name="FEN" values="ADCFSTAT__FEN"/>
         </register>
         <register caption="ADC FIFO Data Register" name="ADCFIFO" offset="0xbc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
