Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM100.atdf
         <register caption="CAN Acceptance Filter " name="C1RXF9" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF9__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF9__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF9__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF9" offset="0x11d0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF9__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF9__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF9__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF10" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF10__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF10__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF10__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF10" offset="0x11e0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF10__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF10__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF10__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF11" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF11__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF11__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF11__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF11" offset="0x11f0" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF11__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF11__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF11__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF12" offset="0x200" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF12__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF12__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF12__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF12" offset="0x1200" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF12__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF12__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF12__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF13" offset="0x210" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF13__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF13__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF13__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF13" offset="0x1210" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF13__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF13__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF13__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF14" offset="0x220" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF14__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF14__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF14__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF14" offset="0x1220" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF14__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF14__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF14__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF15" offset="0x230" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF15__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF15__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF15__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF15" offset="0x1230" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF15__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF15__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF15__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C1RXF16" offset="0x240" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF16__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF16__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF16__SID"/>
         </register>
         <register caption="CAN Acceptance Filter " name="C2RXF16" offset="0x1240" rw="RW" size="4">
            <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C2RXF16__EID"/>
            <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C2RXF16__EXID"/>
            <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C2RXF16__SID"/>
         </register>
