Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM100.atdf
      <value-group caption="Change Notice Control ON bit" name="CNCOND__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONE__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONE__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONF__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONF__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONG__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1"/>
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0"/>
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONG__ON">
         <value caption="CN is enabled" name="" value="0x1"/>
         <value caption="CN is disabled" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="01441" name="I2C" version="">
      <register-group name="I2C">
         <register caption="I2C Control Register" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C1CON__SEN"/>
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN"/>
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C1CON__PEN"/>
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN"/>
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN"/>
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT"/>
            <bitfield caption="SCLx Clock Stretch Enable" mask="0x00000040" name="STREN" values="I2C1CON__STREN"/>
            <bitfield caption="General Call Enable" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN"/>
            <bitfield caption="SMBus Input Levels" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN"/>
            <bitfield caption="Disable Slew Rate Control" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW"/>
            <bitfield caption="10-bit Slave Address" mask="0x00000400" name="A10M" values="I2C1CON__A10M"/>
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT"/>
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL"/>
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON"/>
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C1CON__DHEN"/>
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C1CON__AHEN"/>
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C1CON__SBCDE"/>
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C1CON__SDAHT"/>
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C1CON__BOEN"/>
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C1CON__SCIE"/>
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C1CON__PCIE"/>
         </register>
         <register caption="I2C Control Register" name="I2C2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C2CON__SEN"/>
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN"/>
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C2CON__PEN"/>
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN"/>
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN"/>
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT"/>
            <bitfield caption="SCLx Clock Stretch Enable" mask="0x00000040" name="STREN" values="I2C2CON__STREN"/>
            <bitfield caption="General Call Enable" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN"/>
            <bitfield caption="SMBus Input Levels" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN"/>
            <bitfield caption="Disable Slew Rate Control" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW"/>
            <bitfield caption="10-bit Slave Address" mask="0x00000400" name="A10M" values="I2C2CON__A10M"/>
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT"/>
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL"/>
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON"/>
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C2CON__DHEN"/>
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C2CON__AHEN"/>
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C2CON__SBCDE"/>
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C2CON__SDAHT"/>
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C2CON__BOEN"/>
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C2CON__SCIE"/>
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C2CON__PCIE"/>
         </register>
         <register caption="I2C Control Register" name="I2C3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C3CON__SEN"/>
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C3CON__RSEN"/>
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C3CON__PEN"/>
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C3CON__RCEN"/>
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C3CON__ACKEN"/>
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C3CON__ACKDT"/>
            <bitfield caption="SCLx Clock Stretch Enable" mask="0x00000040" name="STREN" values="I2C3CON__STREN"/>
            <bitfield caption="General Call Enable" mask="0x00000080" name="GCEN" values="I2C3CON__GCEN"/>
            <bitfield caption="SMBus Input Levels" mask="0x00000100" name="SMEN" values="I2C3CON__SMEN"/>
            <bitfield caption="Disable Slew Rate Control" mask="0x00000200" name="DISSLW" values="I2C3CON__DISSLW"/>
            <bitfield caption="10-bit Slave Address" mask="0x00000400" name="A10M" values="I2C3CON__A10M"/>
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable" mask="0x00000800" name="STRICT" values="I2C3CON__STRICT"/>
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C3CON__SCLREL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C3CON__SIDL"/>
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C3CON__ON"/>
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C3CON__DHEN"/>
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C3CON__AHEN"/>
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C3CON__SBCDE"/>
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C3CON__SDAHT"/>
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C3CON__BOEN"/>
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C3CON__SCIE"/>
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C3CON__PCIE"/>
         </register>
         <register caption="I2C Control Register" name="I2C4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C4CON__SEN"/>
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C4CON__RSEN"/>
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C4CON__PEN"/>
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C4CON__RCEN"/>
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C4CON__ACKEN"/>
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C4CON__ACKDT"/>
            <bitfield caption="SCLx Clock Stretch Enable" mask="0x00000040" name="STREN" values="I2C4CON__STREN"/>
            <bitfield caption="General Call Enable" mask="0x00000080" name="GCEN" values="I2C4CON__GCEN"/>
            <bitfield caption="SMBus Input Levels" mask="0x00000100" name="SMEN" values="I2C4CON__SMEN"/>
            <bitfield caption="Disable Slew Rate Control" mask="0x00000200" name="DISSLW" values="I2C4CON__DISSLW"/>
            <bitfield caption="10-bit Slave Address" mask="0x00000400" name="A10M" values="I2C4CON__A10M"/>
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable" mask="0x00000800" name="STRICT" values="I2C4CON__STRICT"/>
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C4CON__SCLREL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C4CON__SIDL"/>
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C4CON__ON"/>
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C4CON__DHEN"/>
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C4CON__AHEN"/>
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C4CON__SBCDE"/>
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C4CON__SDAHT"/>
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C4CON__BOEN"/>
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C4CON__SCIE"/>
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C4CON__PCIE"/>
         </register>
         <register caption="I2C Control Register" name="I2C5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit" mask="0x00000001" name="SEN" values="I2C5CON__SEN"/>
            <bitfield caption="Repeated Start Condition Enable bit" mask="0x00000002" name="RSEN" values="I2C5CON__RSEN"/>
            <bitfield caption="Stop Condition Enable bit" mask="0x00000004" name="PEN" values="I2C5CON__PEN"/>
            <bitfield caption="Receive Enable bit" mask="0x00000008" name="RCEN" values="I2C5CON__RCEN"/>
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C5CON__ACKEN"/>
            <bitfield caption="Acknowledge Data bit" mask="0x00000020" name="ACKDT" values="I2C5CON__ACKDT"/>
            <bitfield caption="SCLx Clock Stretch Enable" mask="0x00000040" name="STREN" values="I2C5CON__STREN"/>
            <bitfield caption="General Call Enable" mask="0x00000080" name="GCEN" values="I2C5CON__GCEN"/>
            <bitfield caption="SMBus Input Levels" mask="0x00000100" name="SMEN" values="I2C5CON__SMEN"/>
            <bitfield caption="Disable Slew Rate Control" mask="0x00000200" name="DISSLW" values="I2C5CON__DISSLW"/>
            <bitfield caption="10-bit Slave Address" mask="0x00000400" name="A10M" values="I2C5CON__A10M"/>
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable" mask="0x00000800" name="STRICT" values="I2C5CON__STRICT"/>
            <bitfield caption="SCLx Release Control bit" mask="0x00001000" name="SCLREL" values="I2C5CON__SCLREL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C5CON__SIDL"/>
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C5CON__ON"/>
            <bitfield caption="Data Hold Enable bit" mask="0x00010000" name="DHEN" values="I2C5CON__DHEN"/>
            <bitfield caption="Address Hold Enable bit" mask="0x00020000" name="AHEN" values="I2C5CON__AHEN"/>
            <bitfield caption="Slave Mode Bus Collision Detect Enable bit" mask="0x00040000" name="SBCDE" values="I2C5CON__SBCDE"/>
            <bitfield caption="SDA Hold Time Selection bit" mask="0x00080000" name="SDAHT" values="I2C5CON__SDAHT"/>
            <bitfield caption="Buffer Overwrite Enable bit" mask="0x00100000" name="BOEN" values="I2C5CON__BOEN"/>
            <bitfield caption="Start Condition Interrupt Enable bit" mask="0x00200000" name="SCIE" values="I2C5CON__SCIE"/>
            <bitfield caption="Stop Condition Interrupt Enable bit" mask="0x00400000" name="PCIE" values="I2C5CON__PCIE"/>
         </register>
