Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.1.45/atdf/PIC32MZ1024EFM100.atdf
      <value-group caption="Host Request Control bit" name="USBOTG__HOSTREQ">
         <value caption="USB module initiates the Host Negotiation when Suspend mode is entered. This bit is cleared when Host Negotiation is completed." name="" value="0x1"/>
         <value caption="Host Negotiation is not taking place" name="" value="0x0"/>
      </value-group>
      <value-group caption="Host Mode bit" name="USBOTG__HOSTMODE">
         <value caption="USB module is acting as a Host" name="" value="0x1"/>
         <value caption="USB module is not acting as a Host" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Level Detection bits" name="USBOTG__VBUS">
         <value caption="Above Vbus Valid" name="" value="0x3"/>
         <value caption="Above AValid" name="" value="0x2"/>
         <value caption="Above Session End" name="" value="0x1"/>
         <value caption="Below Session End" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low-Speed Device Detection bit" name="USBOTG__LSDEV">
         <value caption="A Low-Speed device has been detected being connected to the port" name="" value="0x1"/>
         <value caption="No Low-Speed device detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Full-Speed/Hi-Speed device detection bit (" name="USBOTG__FSDEV">
         <value caption="A Full-Speed or Hi-Speed device has been detected being connected to the port" name="" value="0x1"/>
         <value caption="No Full-Speed or Hi-Speed device detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Device Type bit" name="USBOTG__BDEV">
         <value caption="USB is operating as a B device" name="" value="0x1"/>
         <value caption="USB is operating as an A device" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Endpoint DMA Assertion Control bit" name="USBOTG__RXEDMA">
         <value caption="DMA_REQ signal for all OUT endpoints will be deasserted when MAXP-8 bytes have been written to an endpoint. This is Early mode." name="" value="0x1"/>
         <value caption="DMA_REQ signal for all OUT endpoints will be deasserted when MAXP bytes have been written to an endpoint. This is Late mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Endpoint DMA Assertion Control bit" name="USBOTG__TXEDMA">
         <value caption="DMA_REQ signal for all IN endpoints will be deasserted when MAXP-8 bytes have been written to an endpoint. This is Early mode." name="" value="0x1"/>
         <value caption="DMA_REQ signal for all IN endpoints will be deasserted when MAXP bytes have been written to an endpoint. This is Late mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Endpoint FIFO packet size bits" name="USBOTG__TXFIFOSZ">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="4096 bytes" name="" value="0x9"/>
         <value caption="2048 bytes" name="" value="0x8"/>
         <value caption="1024 bytes" name="" value="0x7"/>
         <value caption="512 bytes" name="" value="0x6"/>
         <value caption="256 bytes" name="" value="0x5"/>
         <value caption="128 bytes" name="" value="0x4"/>
         <value caption="64 bytes" name="" value="0x3"/>
         <value caption="32 bytes" name="" value="0x2"/>
         <value caption="16 bytes" name="" value="0x1"/>
         <value caption="8 bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Endpoint Double-packet Buffering Control bit" name="USBOTG__TXDPB">
         <value caption="Double-packet buffer is supported. This doubles the size set in TXFIFOSZ." name="" value="0x1"/>
         <value caption="Double-packet buffer is not supported" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Endpoint FIFO Packet Size bits" name="USBOTG__RXFIFOSZ">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xe"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Reserved" name="" value="0xc"/>
         <value caption="Reserved" name="" value="0xb"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="4096 bytes" name="" value="0x9"/>
         <value caption="2048 bytes" name="" value="0x8"/>
         <value caption="1024 bytes" name="" value="0x7"/>
         <value caption="512 bytes" name="" value="0x6"/>
         <value caption="256 bytes" name="" value="0x5"/>
         <value caption="128 bytes" name="" value="0x4"/>
         <value caption="64 bytes" name="" value="0x3"/>
         <value caption="32 bytes" name="" value="0x2"/>
         <value caption="16 bytes" name="" value="0x1"/>
         <value caption="8 bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Endpoint Double-packet Buffering Control bit" name="USBOTG__RXDPB">
         <value caption="Double-packet buffer is supported. This doubles the size set in RXFIFOSZ." name="" value="0x1"/>
         <value caption="Double-packet buffer is not supported" name="" value="0x0"/>
      </value-group>
      <value-group caption="Release Candidate bit" name="USBHWVER__RC">
         <value caption="USB module was created using a release candidate" name="" value="0x1"/>
         <value caption="USB module was created using a full release" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Hub Multiple Translators bit" name="USBE0TXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX Hub Multiple Translators bit" name="USBE0RXA__MULTTRAN">
         <value caption="The USB 2.0 hub has multiple transaction translators" name="" value="0x1"/>
         <value caption="The USB 2.0 hub has a single transaction translator" name="" value="0x0"/>
      </value-group>
